const DEBUG_LEVEL = process.env.DEBUG_LEVEL || 'info';

const CHANNEL = {
  SMS: 'sms',
  VIBER: 'viber',
  CASCADE: 'viber_sms'
};

const EVENTS = {
  TOKEN_DATA: 'tokenData',
  STATUS_MESSAGE: 'statusMessage',
  MESSAGE_ID: 'messageId',
  MESSAGE_BATCH: 'messageBatch'
};

enum STATUS {
  I_OK,                         // Промежуточный статус
  I_SEND,                       // Сообщение отправлено в обработку
  DELIVERED,                    // Сообщение доставлено адресату
  EXPIRED,                      // Период допустимости сообщения истек
  DELETED,                      // Сообщение было удалено
  UNDELIVERABLE,                // Сообщение является недоставляемым
  ACCEPTED,                     // Сообщение находится в принятом состоянии (то есть, прочитано вручную от имени абонента клиентской службы)
  UNKNOWN,                      // Сообщение находится в ошибочном состоянии
  REJECTED,                     // Сообщение находится в отвергаемом состоянии
  VIEWED,                       // сообщение просмотрено (для Viber)

  E_INVALID_PHONE_LENGTH = 200,           // длина телефона > 14 или < 10
  E_INVALID_TEXT_LENGTH,           // длина текста (> 480(sms) or == 0) или (> 1000(viber)) символов
  E_INVALID_SENDER,                // имя отпраителя не зарегистрировано / не одобрено / удалено
  E_FORBIDDEN_PHONE,               // телефон в черном списке
  E_LOCALES_MIX,                   // есть слова, которые содержат латинские и кириллические символы без специальных символов
  E_NFOUOD_RECEPIENTS,             // Не указан получатель(и)

  E_OPERATOR_NFOUND = 300,            // оператор не может быть определен для этого номера
  E_OPERATOR_GROUP_NFOUND,     // нет группыы операторов, в которой ищется оператор
  E_TRAFFIC_SCHEMA_NFOUND,
  E_SCHEMA_POOL_BINDING_NDEF,

  E_RATE_NFOUND = 400,                 // Тариф не найден для текущей групп операторов / страны
  E_NEN_FUNDS,                  // Не достаточно средств на аккаунте
  E_OP_NFOUND,                  // Не найден оператор при тарификации
  E_SIGN_INVALID,               // Не верная подпись в сообщении
  E_TPL_NFOUN,                  // Шаблон сообщения не найден
  E_SIGN_NFOUND,                // подпись не найдена

  STATUS_WAIT_TIMEOUT = 500,    // Время ожидания статуса истекло
  I_AGREGATOR_SEND = 600        // Отправлено агрегатору
}

enum STATUS_EXTEND {
  DELIVERED,                    // сообщение доставлено или оператор не предоставил расширенный статус
  UNKNOWN,                      // Неизвестная ошибка.
  ABSENT_SUBSCRIBER,            // Абонент недоступен.  Например, из­за уровня сигнала, выключения телефона
  CALL_BARRED,                  // У абонента включен запрет на прием сообщений или абонент временно заблокирован оператором (например, в связи с отрицательным балансом).
  FAILURE,                      // Внутренняя ошибка  оператора. Например, ошибка  маршрутизации, ошибка коммутатора (внутренняя ошибка  передачи данных) и т.п
  MEMORY_CAPACIY_EXCEEDED,      // Память телефона абонента переполнена
  TELESERVICE_NOT_PROVISIONED,  // Сервис коротких сообщений не предоставляется. Например, услуга SMS не подключена или временно заблокирована, либо аппарат абонента не поддерживает обмен короткими текстовыми сообщениями
  TIMEOUT,                      // Истекло время ожидания ответа от SMS­центра или от аппарата абонента.
  UNKNOWN_SUBSCRIBER,           // Номер телефона не существует (или не обслуживается, не  распознан оператором, абонент не зарегистрирован в сети оператора и т.п.).
  VIBER_INTERNAL_ERROR_1 = 10,       // Внутренняя ошибка сервиса.
  VIBER_INTERNAL_ERROR_2,      // Внутренняя ошибка сервиса.
  VIBER_NOT_SENT,              // Сообщение не отправлено за  указанное время.
  VIBER_STATUS_WAIT_TIMEOUT,   // Статус доставки не получен от оператора в течение установленного тайм­аута.
  VIBER_OPERATOR_UNVAILABLE,   // Техническая проблема  на стороне оператора.
  VIBER_INTERNAL_ERROR_3,      // Внутренняя ошибка сервиса.
  VIBER_UNKNOWN_ERROR_1,       // Неизвестная ошибка оператора.
  VIBER_EXPIRED_1,             // Истек срок жизни сообщения (TTL).
  VIBER_REJECTED,              // Отказ оператора в передаче сообщения.
  VIBER_BLOCKED, // Абонент заблокировал имя отправителя.
  VIBER_USER_NOT_FOUND, // Абонент не зарегистрирован в Viber.
  VIBER_NO_DEVICE, // Для мобильного устройства абонента не предусмотрены Viber­рассылки (как правило это планшеты)
  VIBER_UNKNOWN_ERROR_2, // Неизвестная ошибка оператора.
  VIBER_EXPIRED_2, // Истек срок жизни сообщения (TTL).

  STATUS_WAIT_TIMEOUT = 2000, // Агрегатор завершил  ожидание статуса по данной SMS от оператора (статус доставки не получен от оператора в течение  установленного тайм­ аута).
  SPAM_FILTER_DESTINATION_ADDR, // 3аблокировано спам­фильтром: запрещена отправка SMS на данный номер телефона.
  SPAM_FILTERSOURCE_ADDR, // Заблокировано спам­ фильтром: запрещена отправка SMS с данного короткого номера.
  SPAM_FILTERMESSAGE, // Заблокировано спам­фильтром: текст сообщения содержит запрещенные слова.
  BAN_INTERNATIONAL_DESTINATION = 2006, // Запрет на международное направление. Например, запрет на страну или на международного оператора.
}

export {
  CHANNEL,
  DEBUG_LEVEL,
  EVENTS,
  STATUS,
  STATUS_EXTEND
};
